[
    "Is that your best attempt? Try harder next time.",
    "Oh, sorry, I was too busy ignoring you.",
    "If ignorance is bliss, you must be the happiest person alive.",
    "I'd agree with you, but then we'd both be wrong.",
    "You bring everyone so much joy... when you leave the room.",
    "I’m not saying I hate you, but I would unplug your life support to charge my phone.",
    "I see you’ve set aside this special time to humiliate yourself in public.",
    "You're like a software update. Whenever I see you, I think, 'Not now.'",
    "I’d explain it to you, but I left my English-to-Dingbat dictionary at home.",
    "You're proof that even evolution makes mistakes.",
    "I’m not arguing. I’m just explaining why I’m right.",
    "I thought of you today. It reminded me to take out the trash.",
    "You have the right to remain silent because whatever you say will probably be stupid anyway.",
    "I’m jealous of people who don’t know you.",
    "I don’t have the energy to pretend I like you today.",
    "You’re about as useful as a screen door on a submarine.",
    "I’d call you a tool, but that implies you’re actually useful.",
    "You’re like a cloud. When you disappear, it’s a beautiful day.",
    "I’m not insulting you; I’m describing you.",
    "I would explain it to you, but it would just confuse you more.",
    "You're not stupid; you just have bad luck when it comes to thinking.",
    "I’d love to see things from your perspective, but I can’t get my head that far up my ass.",
    "You're the reason God created the middle finger.",
    "I'd offer you a nasty look, but you already have one.",
    "You’re like a candle in the wind... useless and easily extinguished.",
    "I'd say you're full of crap, but that would imply there's something in there.",
    "You must have been born on a highway because that's where most accidents happen.",
    "I’m not saying you’re lazy, but if there were an award for laziness, you’d probably send someone to pick it up for you.",
    "You’re proof that even the worst can survive.",
    "If I wanted to hear from an asshole, I’d fart.",
    "You’re like a software bug—annoying and hard to get rid of.",
    "I’d call you a joke, but that would imply you’re funny.",
    "You bring so much joy when you leave the room.",
    "You're about as bright as a black hole and twice as dense.",
    "I would agree with you, but then we’d both be wrong.",
    "You’re like a broken pencil—pointless.",
    "Somewhere out there is a village missing its idiot. You should go home.",
    "You’re not completely worthless; you can always serve as a bad example.",
    "I don't know what makes you so dumb, but it really works.",
    "You're like a software update—whenever I see you, I think 'Not now.'",
    "You’re the reason they put instructions on shampoo bottles.",
    "You're like a slinky—you're not really good for much, but it's fun to watch you fall down the stairs.",
    "You have an entire life to be an idiot. Why not take today off?",
    "You're as useless as a white crayon.",
    "If laughter is the best medicine, your face must be curing the world.",
    "I’d call you a tool, but that implies you're useful for something.",
    "You're like a light switch—off most of the time and only occasionally useful.",
    "If I had a dollar for every time I saw someone as annoying as you, I’d have one dollar.",
    "You’re like a software license agreement—everyone just ignores you until they have to deal with you.",
    "I don’t know what your problem is, but I’m sure it’s hard to pronounce.",
    "You’re so dense, light bends around you.",
    "You look like a “before” photo.",
    "I believed in evolution until I met you.",
    "Even Bob Ross would call you a mistake.",
    "If ugly was a day, you’d be an entire year.",
    "Row, row, row your boat gently down a cliff.",
    "You’re proof that God has a sense of humor.",
    "You’re the reason the divorce rate is so high.",
    "Brush your teeth before you open your mouth.",
    "Don’t you have to get a license to be that ugly?",
    "I would hit you, but that would be animal abuse.",
    "Your opinion is almost as bad as your eyebrows.",
    "Your teeth are so yellow, even the sun is jealous.",
    "If you ran like your mouth, you’d be in better shape.",
    "I’m ugly? Perfect. I was trying to look like you today.",
    "Life is full of disappointments. I just added you to the list.",
    "Keep rolling your eyes. Maybe you’ll find a brain back there.",
    "I’d give you a dirty look, but it looks like you already have one.",
    "I’d love to insult you but it won’t be as good as what nature did.",
    "I’d love to stay and chat, but I’d rather have open heart surgery.",
    "If you’re going to be two-faced, at least make one of them pretty.",
    "I bet your parents change the subject when their friends ask about you.",
    "You’re the type of person to look up and down before crossing the road.",
    "I was going to make a joke about your life, but it looks like life got there first.",
    "I was going to roast you, but then I heard burning trash is an environmental hazard.",
    "I’ve been called worse by better.",
    "You have the perfect face for radio.",
    "Must be nice to never use your brain.",
    "You’re so fake, even Barbie is jealous.",
    "You’re so ugly you’d make a Happy Meal cry.",
    "I’d agree with you but then we’d both be wrong.",
    "I’d be nice if you used glue instead of chapstick.",
    "Don’t stand too close to the heater…Plastic melts.",
    "You better check your outfit before you come for me.",
    "It sucks that you can’t Facetune your ugly personality.",
    "Hold still…I’m trying to imagine you with a personality.",
    "You bring me so much joy…when you leave the room.",
    "I forgot the whole world revolves around you. My bad!",
    "You’re not pretty enough to have such an ugly personality.",
    "You’re not just a drama queen. You’re the whole royal family.",
    "The only way you’ll get a partner is if you go on Love is Blind.",
    "Your grades say marry rich, but your mirror says study harder.",
    "There’s someone out there for everyone. For you, that’s a therapist.",
    "I bet I could remove 99% of your attractiveness with a makeup wipe.",
    "If I had a dollar for every time you said something smart, I’d be broke.",
    "Awww. It’s so cute when you try to talk about things you don’t understand.",
    "It’s hilarious how you’re trying to fit your entire vocabulary into one sentence.",
    "There’s a new app called “being a decent human.” You should download it for research purposes.",
    "You’re sort of like Rapunzel, but instead of letting your hair down, you let down everyone in your life.",
    "Shock me. Say something intelligent.",
    "You want to hear a good joke? Your life.",
    "I’m not insulting you. I’m describing you.",
    "Do you get off on making people hate you?",
    "How does it feel to get mogged all the time?",
    "If you had two brains, you’d be twice as stupid.",
    "I may love to shop, but I’m not buying your crap.",
    "I can’t tell what’s worse…Your IQ or your hairline.",
    "You look like Bob the Builder and Shrek had a baby.",
    "Remember when I asked for your opinion? Me either.",
    "If you fear success, you’ve got nothing to worry about.",
    "Why play hard to get when you’re already hard to want?",
    "I’m sorry. Did the middle of my sentence interrupt the beginning of yours?",
    "It’s scary to think that people like you are allowed to vote.",
    "Whoever told you to be yourself gave you really bad advice.",
    "Do you work at a grocery store? Then stop checking me out.",
    "You look like someone dropped a lollipop at the barber shop."
]
