[
    "Are you a magician? Because whenever I look at you, everyone else disappears.",
    "Do you have a map? I keep getting lost in your eyes.",
    "If you were a vegetable, you'd be a cutecumber.",
    "Are you a parking ticket? Because you’ve got FINE written all over you.",
    "Do you believe in love at first sight, or should I walk by again?",
    "Is your name Google? Because you have everything I’ve been searching for.",
    "Are you a campfire? Because you’re hot and I want s'more.",
    "Do you have a Band-Aid? Because I just scraped my knee falling for you.",
    "If you were a fruit, you’d be a fineapple.",
    "Are you from Tennessee? Because you're the only ten I see.",
    "Is your dad a baker? Because you're a cutie pie.",
    "Are you Wi-Fi? Because I'm really feeling a connection.",
    "Do you like raisins? How do you feel about a date?",
    "If beauty were time, you'd be an eternity.",
    "Is your name Chapstick? Because you’re da balm!",
    "Are we at the airport? Because my heart is taking off.",
    "If kisses were snowflakes, I’d send you a blizzard.",
    "You must be tired because you've been running through my mind all day.",
    "Are you an interior decorator? Because when I saw you, the entire room became beautiful.",
    "Do you believe in fate? Because I think we were meant to meet.",
    "Is your name Dunkin? Because I donut want to spend another day without you.",
    "If I could rearrange the alphabet, I’d put U and I together.",
    "Are you a loan from a bank? Because you have my interest!",
    "Do you have a sunburn, or are you always this hot?",
    "Is your aura made of copper and tellurium? Because you're Cu-Te.",
    "If looks could kill, you'd be a weapon of mass destruction.",
    "Are you French? Because Eiffel for you.",
    "You must be made of copper and tellurium because you're Cu-Te!",
    "Can I follow you home? Cause my parents always told me to follow my dreams.",
    "If I were to ask you out, would your answer be the same as the answer to this question?",
    "Are you an angel? Because heaven is missing one.",
    "Is your name Starbucks? Because I like you a latte!",
    "I must be a snowflake because I've fallen for you.",
    "Are you a time traveler? Because I can see you in my future.",
    "Excuse me, but I think you dropped something: my jaw!",
    "Do you have any raisins? No? How about a date?",
    "If beauty were a crime, you'd be serving a life sentence.",
    "You must be a magician because every time I look at you, everyone else disappears.",
    "Are you made of bouncy castle material? Because you're making me feel all floaty inside!",
    "Do you know what would look great on you? Me!",
    "Is your name Wi-Fi? Because I'm feeling a connection.",
    "You must be made of stardust because your beauty lights up the night.",
    "Can I take you out for dinner? Because I can't seem to get you out of my mind!",
    "Are we at the zoo? Because you're a real keeper!",
    "Is your name Dunkin? Because I donut want to spend another day without you.",
    "Do you have a pencil? Cause I want to erase your past and write our future.",
    "If beauty were a crime, you'd be serving a life sentence.",
    "You must be a magician because every time I look at you, everyone else disappears.",
    "Is your name Chapstick? Because you're da balm!",
    "Are we at the airport? Because my heart is taking off.",
    "If kisses were snowflakes, I'd send you a blizzard.",
    "You must be tired because you've been running through my mind all day.",
    "Are you an interior decorator? Because when I saw you, the entire room became beautiful.",
    "Do you believe in fate? Because I think we were meant to meet.",
    "Is your name Dunkin? Because I donut want to spend another day without you.",
    "If I could rearrange the alphabet, I'd put U and I together.",
    "Are you a loan from a bank? Because you have my interest!",
    "Do you have a sunburn, or are you always this hot?",
    "Is your aura made of copper and tellurium? Because you're Cu-Te.",
    "If looks could kill, you'd be a weapon of mass destruction.",
    "Are you French? Because Eiffel for you.",
    "You must be made of copper and tellurium because you're Cu-Te!",
    "Can I follow you home? Cause my parents always told me to follow my dreams.",
    "If I were to ask you out, would your answer be the same as the answer to this question?",
    "Are you an angel? Because heaven is missing one.",
    "Is your name Starbucks? Because I like you a latte!",
    "I must be a snowflake because I've fallen for you.",
    "Are you a time traveler? Because I can see you in my future.",
    "Excuse me, but I think you dropped something: my jaw!",
    "Do you have any raisins? No? How about a date?",
    "If beauty were a crime, you'd be serving a life sentence."
]
 
